OpenFOAM-pulsingJet_cases/2d_jet_coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
		uniformValue	sine;
		uniformValueCoeffs
		{
			frequency	2;
			amplitude	5;
			scale		(0 0 1);
			level		(0 0 10);
		}
    }
	
	outlet
    {
        type            zeroGradient;
    }
	
	walls
    {
        type            fixedValue;
		value	uniform (0 0 0);
    }

	frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
